<?
// //========================VVV====это мое решение задачи по записи логов в файл ======================================
// if (is_file('log/'.PATH_LOG)) { // проверяем есть ли файл с логами

// 	$flog = fopen('log/'.PATH_LOG, 'r'); // получаем дискриптор (доступ к файлу) файла с логами

// 	$fLines = [];                          //создаем массив и
// 	while ($line = fgets($flog)) {		   //циклом заносим в него строки из файла с логами	
// 		$fLines[] = $line;
// 	}
// 	fclose($flog);

// } else {
// 	echo "NO log file!";
// }

// foreach ($fLines as  $key => $value) { //циклом выводим файлы лога
// 	if ($key != 0) {
// 		echo "Посещение N <b>" . $key . "</b> было: <b>" . $value . "</b><br>";
// 	}
// }
//========================^^^^^====это мое решение задачи по записи логов в файл ======================================

//========================ниже решение учителя=============================================

if (is_file('log/'.PATH_LOG)) :

	$file2 = file('log/'.PATH_LOG); // Читает содержимое файла и помещает его в массив

	echo "<ol>";

	foreach ($file2 as $line) {
		list($dt2, $page2, $ref2) = explode("|", $line);
		$dt2 = date("d-m-Y H:i:s", $dt2);
		echo "<li>";
		echo "$dt2 - $ref2 -> $page2";
		echo "</li>";
	}

	echo "</ol>";

endif;